[
    {
        "created": "20220323224601145",
        "title": "Create New Service Description",
        "modified": "20220622212158218",
        "tags": "[[Create New]]",
        "type": "text/vnd.tiddlywiki",
        "text": "\\define Generate(service, nameSuffix)\n<$action-createtiddler $basetitle=\"Service Description - $service$ - $nameSuffix$\"\ntext=\"{{||Service Description Template}}\"\ndescription = {{!!Description}}\nsample_projects = {{!!sample_projects}}\nservice_name = \"$service$\"\nEntryType = \"Service Description\"\ntags = \"Entry\"\nword_count=\"\"\"<$count filter=\"[all[current]get[description]split[ ]]\" />\"\"\"\n>\n<$action-navigate $to=<<createTiddler-title>>/>\n</$action-createtiddler>\n\\end\n\n\\define checkAlreadyExists(service, nameSuffix)\n<$list filter = \"[all[current]!field:service[]!field:suffix[]]\">\n<$list filter=\"[field:title[Service Description - $service$ - $nameSuffix$]]\">\n<mark> A Service description called <b> Service Description - $service$ - $nameSuffix$ </b> already exists! </mark>\n</$list>\n</$list>\n\\end\n\n\\define clear()\n<$action-setfield \nsample_projects=\"\" \nDescription=\"\"\nsuffix=\"\" \nservice=\"\" \n/>\n\\end\n\n<h2> Enter the information for the new Service Description </h2>\n\n<$macrocall $name=\"checkAlreadyExists\" service={{!!service}} nameSuffix = {{!!suffix}} />\n\n|table-style|k\n|Service Name|<$edit-text field=\"service\" class=\"text-bar\" />|\n|Suffix |<$edit-text field=\"suffix\" class=\"text-bar\" />|\n\nThe New Service Description will be called <b> Service Description - {{!!service}} - {{!!suffix}} </b>\n\n<h3> Description text: </h3>\n<$edit-text field=\"Description\" class = \"tw-edit-texteditor myTextEdit\" tag=\"textarea\"/>\n\n<h3> Sample Projects </h3>\nEnter Sample Projects In The Following Format:\n\n`[[Sample Project 1]]` <br>\n`[[Sample Project 2]]` <br>\n`[[Sample Project 3]]` <br>\n\n<$edit-text field=\"sample_projects\" class = \"tw-edit-texteditor myTextEdit\" tag=\"textarea\"/>\n\n<$button>\nGenerate\n<$macrocall $name=\"Generate\" service={{!!service}} nameSuffix = {{!!suffix}} />\n</$button>\n<$button>\nClear\n<$macrocall $name=\"clear\" />\n</$button>",
        "Description": "At its core, Value Analysis (VA, also known as Value Engineering or VE) is an approach that optimizes function at a reduced cost. With rising expectations and increased public scrutiny coupled with the fiscal constraints faced by capital projects, there is growing pressure to simultaneously advance project performance and taxpayer/investor value. VA represents a small upfront time and cost investment with the potential for significant savings in both, along with improvements in quality, as the project progresses. VA activities identify potential changes to the project design and execution that would satisfy its essential functions at a lower cost. It looks for ways to better accomplish these functions while providing better overall value and improving confidence in their effectiveness. \n\nSMA has developed a unique process for conducting VA studies that adheres to the guidelines set forth by SAVE International but also allows for a more flexible approach in order to make optimal use of workshop participant time. The primary enhancements are:  \na. The introduction of additional pre-work prior to the formal workshop session. Items such as integration with risk or major concerns can be compiled prior to the workshop through interviews with stakeholders to be reviewed by the participants during the workshop. \nb. The addition of research-based advances in the creative phase, which increase the efficiency and quality of ideas captured. \nc. An agile, integrated approach to the application of the VA methodology throughout the project lifespan, which allows for breaks to gather information prior to making major decisions and encourages the team to revisit the VA study to gauge current project status and to identify additional improvements. \nd. Flexibility in the documentation process, which can save valuable workshop time. The formal report that documents the VA process and results can be created following the workshop session, with the preliminary results validated with a memo a few days following the workshop. Additional data may be gathered through stakeholder surveys or individual interviews with participants as required. \n\nSMA’s certified specialists in VA can facilitate workshops to brainstorm better designs or to determine the design or construction option with the highest value overall. By pooling the expertise and knowledge of our team, the project stakeholders, and other experts in the field, we can ensure that the project not only meets its requirements but exceeds them. We bring together multidisciplinary teams to develop creative, well-supported, and fully documented solutions to engineering problems. We help identify key functions of the project, generate ideas to deliver those functions, and evaluate those ideas through the lens of value: the ratio of function to cost. The process is focused on ensuring that the options are as robust as possible, and that a broad spectrum of innovative and creative options have been considered. Once the options have been selected for detailed comparison, the VA team will use the evaluation criteria and decision-making framework to guide option analysis and value calculation.\n\nAs indicated in our schedule and in keeping with the RFP, we propose to hold the two concept design phase workshops as soon as possible. The intent of the Value Analysis workshops is to determine the highest value design option to carry forward to the next design phases and to propose further ideas which may be incorporated to further enhance or supplement the main design option.\n\nThe Value Analysis process goes through the following tasks described below:\nPhase I: Planning Phase - Planning and organizing the VA workshop, including workshop scope, plan, and logistics. This will be done in consultation with the client and project team. This phase also includes a review of existing documentation and preparation of pre-meeting information packages, and may involve development of preliminary evaluation criteria or other preliminary work in preparation for the workshop(s). \n\nPhase II: Information Phase - This phase involves gathering information about the current state of the project and any constraints that influenced project decisions, including project data and key documents, strategic issues of concern, current design concepts, logistics, performance attributes, and understanding of the project itself, such as its scope, schedule, budget, risk, costs, and issues, and finally, identifying high-level project success parameters. The typical outcome of this phase is to bring all participants to a common level of understanding of the project.\n\nPhase III: Function Analysis - In this phase, participants will gain understanding of the project from a functional perspective: what must the project do, rather than how is the project currently conceived. The key question is, what are the functions and how are they related? The typical outcome of this phase is to focus the team on validating that the project satisfies the need and objectives of the customer, to provide a more comprehensive understanding of the project by focusing on what the project does or must do rather than what it is, and to identify value mismatched functions and improvement opportunities.\n\nPhase IV: Creativity Phase - In the Creativity Phase, the focus is on generating a quantity of ideas related to other ways to perform the functions which have been identified. The typical outcome here is a broad array of ideas that provide a wide variety of possible alternative ways to perform the functions to improve the value of the project.\n\nPhase V: Evaluation Phase - The Evaluation Phase focuses on evaluating the ideas which have been produced and reducing their number to a short list of ideas with the greatest potential to improve the project. The key question being asked in this phase is: of all these ideas, which are worth spending quality time to further develop? The typical outcome of this phase is one or more concepts that warrant more time to develop into value-based solutions that can be implemented into a project or project feature.\n\nPhase VI: Development Phase - During this phase, the study participants further analyze and develop the short list of ideas and develop those with merits into value alternatives. The purpose of this phase is to clearly describe each selected idea, develop a rationale for making each change, and identify ideas which are mutually exclusive. Ultimately, the VA team creates alternatives and low-medium-high risk scenarios and offers these alternatives to senior management as options that address the pre-workshop objectives.\n\nPhase VII: Presentation Phase - In this phase, the VA team presents their value alternatives to the management team and other project stakeholders. An idea that has value may conflict with strategic plans; it is important that senior management understand the ideas being presented. The final outcome of this phase is a formal report, but it is preferable for the VA team to present their findings in person to allow for questions. Ideas presented may include (1) options, which are complete alternatives requiring choice, (2) value suggestions, which could be applied to one or more options and would result in cost or schedule savings, and (3) design suggestions, which could result in performance improvements, efficiencies, safety improvements, or other benefits, but are not essential to the solution sought. \n\nPhase VIII. Implementation Phase - The post-workshop implementation stage is the most important of all of the preceding phases, as an idea that is not implemented translates to a benefit not realized. The project team must develop a plan for how to implement and track the ideas developed, and decision-makers must choose which options, value suggestions, and design suggestions will be implemented. The results will provide context for these discussions. Activities of this phase include reviewing the preliminary report, conducting an Implementation Meeting with decision-makers, establishing an action plan, setting a time frame, and tracking value achievement resulting from implemented alternatives. Ultimately, the project stakeholders will be the ones to determine what will change in the project as a result of the VA workshop and incorporate those changes into the project implementation plan.",
        "sample_projects": "",
        "service": "Risk Assessment",
        "suffix": "Workshops (EPCOR)"
    }
]